In [1]:
! pip install pandas

Requirement already satisfied: pandas in c:\users\suyas\anaconda3\lib\site-packages (2.2.2)
Requirement already satisfied: numpy>=1.26.0 in c:\users\suyas\anaconda3\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\suyas\anaconda3\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\suyas\anaconda3\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\suyas\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in c:\users\suyas\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [ ]:
import pandas as pd
#series
s1=pd.Series([10,20,30],index=["ram","shyam","keshav"])
s2=pd.Series([10,40,30],index=["ram","shyam","keshav"])
print(s1+s2)

ram       20
shyam     60
keshav    60
dtype: int64

In [6]:
info = { "Name" : ["Adam","Eve","Bob"],"Marks":[78,99,85],"Grade":['B','O','A']}
df=pd.DataFrame(info)
df

   Name  Marks Grade
0  Adam     78     B
1   Eve     99     O
2   Bob     85     A

In [10]:
print(df.index)
print(df.columns)

RangeIndex(start=0, stop=3, step=1)
Index(['Name', 'Marks', 'Grade'], dtype='object')

In [11]:
df1=pd.read_csv("raw_data.csv")
df1

    id          name   age country   gender   income
0    1      John Doe  29.0     USA     Male  55000.0
1    1      John Doe  29.0     USA     Male  55000.0
2    2    Jane Smith   NaN  Canada   Female  62000.0
3    3          Alex   NaN     USA  Unknown  47000.0
4    4  Maria Garcia  34.0   Spain   Female      NaN
5    5        Li Wei  27.0   China     Male  51000.0
6    6           NaN  45.0   India   Female  73000.0
7    7    Ahmed Khan  38.0     NaN     Male  68000.0
8    8    Rachel Lee  29.0     USA   Female  62000.0
9    9   Carlos Ruiz   NaN  Mexico     Male  45000.0
10  10   Emily Davis  31.0     USA      NaN  58000.0

In [13]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11 entries, 0 to 10
Data columns (total 6 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   id       11 non-null     int64
 1   name     10 non-null     object
 2   age      8 non-null      float64
 3   country  10 non-null     object
 4   gender   10 non-null     object
 5   income   10 non-null     float64
dtypes: float64(2), int64(1), object(3)
memory usage: 660.0+ bytes

In [22]:
df1["age"].describe()
df1.nunique()
df1.shape

(11, 6)

In [30]:
df1.loc[0,["country","age"]]

country     USA
age        29.0
Name: 0, dtype: object

In [33]:
df1.at[0,"country"]

'USA'

In [37]:
my_country="India"
df1.query("country == @my_country" )

   id name   age country  gender   income
6   6  NaN  45.0   India  Female  73000.0

In [42]:
df1["sat"]=df1["income"].apply(lambda x : x -x*0.10 if x>50000 else x -x*0.08)
gender_map={
    "Male":"M",
    "Female":"F",
}
df1["gender"]=df1["gender"].map(gender_map)
df1

    id          name   age country gender   income      sat
0    1      John Doe  29.0     USA      M  55000.0  49500.0
1    1      John Doe  29.0     USA      M  55000.0  49500.0
2    2    Jane Smith   NaN  Canada      F  62000.0  55800.0
3    3          Alex   NaN     USA    NaN  47000.0  43240.0
4    4  Maria Garcia  34.0   Spain      F      NaN      NaN
5    5        Li Wei  27.0   China      M  51000.0  45900.0
6    6           NaN  45.0   India      F  73000.0  65700.0
7    7    Ahmed Khan  38.0     NaN      M  68000.0  61200.0
8    8    Rachel Lee  29.0     USA      F  62000.0  55800.0
9    9   Carlos Ruiz   NaN  Mexico      M  45000.0  41400.0
10  10   Emily Davis  31.0     USA    NaN  58000.0  52200.0

In [48]:
df1.sort_values("age",ascending=False)
df1.reset_index(drop=True)
df1.drop_duplicates()

    id          name   age country gender   income      sat
0    1      John Doe  29.0     USA      M  55000.0  49500.0
2    2    Jane Smith   NaN  Canada      F  62000.0  55800.0
3    3          Alex   NaN     USA    NaN  47000.0  43240.0
4    4  Maria Garcia  34.0   Spain      F      NaN      NaN
5    5        Li Wei  27.0   China      M  51000.0  45900.0
6    6           NaN  45.0   India      F  73000.0  65700.0
7    7    Ahmed Khan  38.0     NaN      M  68000.0  61200.0
8    8    Rachel Lee  29.0     USA      F  62000.0  55800.0
9    9   Carlos Ruiz   NaN  Mexico      M  45000.0  41400.0
10  10   Emily Davis  31.0     USA    NaN  58000.0  52200.0

In [51]:
df1["income"].rank(ascending=False,method="dense")

0     5.0
1     5.0
2     3.0
3     7.0
4     NaN
5     6.0
6     1.0
7     2.0
8     3.0
9     8.0
10    4.0
Name: income, dtype: float64

In [52]:
df1.groupby("country")["income"].mean()

country
Canada    62000.0
China     51000.0
India     73000.0
Mexico    45000.0
Spain         NaN
USA       55400.0
Name: income, dtype: float64

In [53]:
df1.groupby("country")["income"].agg(["mean","max"])

            mean      max
country
Canada   62000.0  62000.0
China    51000.0  51000.0
India    73000.0  73000.0
Mexico   45000.0  45000.0
Spain        NaN      NaN
USA      55400.0  62000.0

In [54]:
df2= df=pd.DataFrame({"country":["USA","USA","India","India"],"year":[2020,2021,2020,2021],"sales":[100,120,90,110],"profit":[20, 25, 18, 22] })

In [55]:
df2

  country  year  sales  profit
0     USA  2020    100      20
1     USA  2021    120      25
2   India  2020     90      18
3   India  2021    110      22

In [56]:
mdf=df2.melt(
    id_vars=["country","sales"],
    value_vars=["year","profit"],
    var_name="metric",
    value_name="value"
)
mdf

  country  sales  metric  value
0     USA    100    year   2020
1     USA    120    year   2021
2   India     90    year   2020
3   India    110    year   2021
4     USA    100  profit     20
5     USA    120  profit     25
6   India     90  profit     18
7   India    110  profit     22

In [57]:
df_customers= pd.DataFrame({ "customer_id": [1,2,3,4],"name":["Adam","Bob","Charlie","Dave"]}) 
df_orders= pd.DataFrame({ "order_id": [101,102,103,104],"customer_id":[2,1,4,5],"amount":[250,120,300,180]})
pd.merge(df_customers,df_orders,on="customer_id")

   customer_id  name  order_id  amount
0            1  Adam       102     120
1            2   Bob       101     250
2            4  Dave       103     300

In [58]:
pd.merge(df_customers,df_orders,on="customer_id",how="left")

   customer_id     name  order_id  amount
0            1     Adam     102.0   120.0
1            2      Bob     101.0   250.0
2            3  Charlie       NaN     NaN
3            4     Dave     103.0   300.0